# Subqueries exercises

Todos los ejercicios y tablas correspondientes se pueden encontrar en:

[Link](https://www.w3resource.com/sql-exercises/sql-subqueries-exercises.php)

En este cuaderno se brindaran soluciones propuestas por mi te recomiendo revisar el contenido del link donde tambien viene un editor de codigo 
para correr tu codigo.

### 1. From the following table, write a SQL query to find those employees who get higher salary than the employee whose ID is 163. Return first name, last name.

Sample Output

![](../images/out1.PNG)

```
SELECT first_name, last_name, salary
FROM employees
WHERE salary >(SELECT salary FROM employees
WHERE employee_id = 163);

```

Adicionalmente agrego el campo salary para verificar que el salary de la consulta es mayor al de la subconsulta

Resultados del codigo

![](../images/res1.PNG)

### 10. From the following table and write a SQL query to find those employees whose salary is in the range of smallest salary, and 2500. Return all the fields.  

```
SELECT * 
FROM employees
WHERE salary BETWEEN
(SELECT MIN(salary) FROM employees) AND 2500;
```

### 11. From the following tables, write a SQL query to find those employees who do not work in those departments where manager ids are in the range 100, 200 (Begin and end values are included.) Return all the fields of the employees.

```
SELECT * 
FROM employees 
WHERE department_id NOT IN 
(SELECT department_id 
FROM departments 
WHERE manager_id BETWEEN 100 AND 200);
```

### 12.From the following table, write a SQL query to find those employees who get second-highest salary. Return all the fields of the employees. 

```

```